Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/asylum_seekers_and_refugees/services_for_asylum_seekers_in_ireland/medical_services_and_entitlements_for_asylum_seekers.html.txt.tmx
Source language: en
Languages: ga

source: Medical services and entitlements for asylum seekers
ga: Seirbhísí agus teidlíochtaí leighis d'iarrthóirí tearmann

source: The Local Health Office in the area where you are living will provide for your medical needs
ga: Freastalóidh an Oifig Sláinte Áitiúil i do cheantarsa ar do riachtanais leighis

source: Your local health centre or Local Health Office can help you find a general practitioner (GP) and provide you with a medical card application form
ga: Cabhróidh an t-ionadaí Roinne Coimirce Sóisialaí (a tugadh an tOifigeach Leasa Pobail air roimhe seo) áitiúil leat liachleachtóir ginearálta a aimsiú agus soláthróidh ionadaí na Roinne foirm iarratais chárta leighis duit, ar cheart duit a chomhlíonadh agus a sheoladh ar ais chuig an Oifig Sláinte Áitiúil chomh luath agus is féidir

source: The medical card gives you and your family access to medical services free of charge
ga: Tugann an cárta leighis rochtain shaor in aisce duit agus do do theaghlach ar sheirbhísí leighis

source: If you do not apply for and receive a medical card, you will be asked to pay for certain medical services
ga: Mura ndéanann tú iarratas ar chárta leighis agus mura bhfaigheann tú ceann, iarrfar ort íoc as seirbhísí leighis áirithe

source: Services available free of charge under the Medical Card Scheme include:
ga: Áirítear le Scéim an Chárta Leighis na seirbhísí saora in aisce seo thíos:

source: • General Practitioner (local doctor) services
ga: • Seirbhísí an liachleachtóra ginearálta (dochtúirí áitiúla)

source: • Hospital in-patientand out-patient services (as a public patient)
ga: • Seirbhísí ospidéil phoiblí d’othair chónaitheacha agus seirbhísí ospidéil phoiblí d’othair sheachtracha (mar othar poiblí)

source: • Prescriptions/medicines (with some exceptions)
ga: • Scríbhinní dochtúra/cógais leighis (le roinnt eisceachtaí)

source: • Psychological services for those traumatised by torture, rape or other critical life experiences
ga: • Seirbhísí síceolaíochta dóibh siúd a bhí trámaithe ag pianadh, éigniú agus géar-eispéireaisí eile beatha

source: • Optical tests and glasses
ga: • Tástálacha optúla agus spéaclaí

source: • Hearing tests and hearing aids
ga: • Seirbhísí na gcluas agus áiseanna éisteachta

source: • Dental treatment for adults
ga: • Seirbhísí fiaclóireachta do dhaoine fásta

source: • Where defects have been noted at school medical examinations, dental treatment for children
ga: • Nuair a thugtar faoi deara fabhtanna ag seirbhísí sláinte scoile, cóir fhiaclóireachta do leanaí

source: Other health services available free of charge are maternity services, immunisation services and health screening.Your local health centre or Local Health Office will advise you about getting access to these services in your resettlement area
ga: Is seirbhísí sláinte eile a bhíonn ar fáil saor in aisce iad seirbhísí máithreachais, vacsainithe agus imdhíontaí agus an scagthástáil. Tabharfaidh d' ionadaí na Roinne áitiúil comhairle duit faoi rochtain a fháil ar na seirbhísí seo i do cheantar athlonnaithe

source: A Local Health Office may have waiting lists for these services and may have to give priority on the basis of medical need
ga: D’fhéadfadh liostaí feithimh a bheith ag Oifig Sláinte Áitiúil do na seirbhísí seo agus féadann tosaíocht a thabhairt ar bhonn an riachtanais leighis

source: If you are pregnant or have small children, your GP may refer you to the local Public Health Nurse or you can contact the service directly yourself through your local health centre or Local Health Office
ga: Má bhíonn tú torrach nó go mbíonn leanaí beaga agat, déanfaidh ionadaí na Roinne socruithe duit chun dul i teagmháil leis an Altra Sláinte Poiblí áitiúil

source: A free medical screening service is available to all asylum seekers
ga: Bíonn seirbhís scagthástála leighis shaor in aisce ar fáil do gach iarrthóir tearmainn

source: This service is completely confidential and independent of your application for international protection (refugee status or subsidiary protection)
ga: Bíonn an tseirbhís seo go hiomlán rúnda agus neamhspleách ar d'iarratas ar chosaint idirnáisiúnta (stádais dhídeanaithe nó fochosaint)

source: The service includes screening for certain infectious diseases such as TB, Hepatitis B, Hepatitis C and HIV and checking the vaccination needs of you and your family
ga: Áirítear leis an tseirbhís scagthástáil um ghalair thógálacha áirithe ar nós na hEitinne, Heipitíteas B, Heipitíteas C agus SEIF agus seiceáil um riachtanais vacsaínithe duitse agus do do theaghlach

source: The outcome of any medical tests you undergo will not affect your application for a declaration of a refugee status in any way
ga: Ní chuirfidh toradh aon tástáil leighis a fhaigheann tú isteach ar d’iarratas ar dhearbhú stádais dhídeanaithe ar aon bhealach

source: There are a number of reasons why you are advised to avail of medical screening
ga: Tá roinnt fáthanna ann go dtugtar comhairle duit le scagthástáil leighis a fháil

source: The screening will identify and treat those who are ill and provide protection against infectious diseases through immunisation
ga: Déanfaidh an scagthástáil na daoine siúd atá tinn a aithint agus a chóireáil agus cosaint a thabhairt i gcoinne galair thógálacha tríd an imdhíonadh

source: Any necessary follow-up medical treatment will be provided for you and your family free of charge under the medical card scheme
ga: Soláthrófar aon chóireáil leighis leantach riachtanach duit agus do do theaghlach saor in aisce faoi scéim an chárta leighis

source: It is in your interest to avail of this service and you can be assured that this service is provided to you and your family in complete confidence
ga: Is é do leas é an tseirbhís seo a fháil agus féadfaidh tú a bheith cinnte de go soláthraítear an tseirbhís seo duit agus do do theaghlach go hiomlán rúnda

source: Contact your local health centre or Local Health Office
ga: Déan teagmháil leis an t-ionadaí Roinne Coimirce Sóisialaí i d'ionad sláinte áitiúil
